SpenceKonde/DxCore/megaavr/boards.txt
##########################################################################
#                                                                        #
#  #######              #####                                            #
#  ##    ##            ##```                                             #
#  ##     ## ##   ##   ##      ###  ####  ####     ##     ####      ###  #
#  ##     ##  ## ##    ##     #   # #   # #       ###     #        #  ## #
#  ##     ##   ###     ##     #   # ####  ###      ##     ####     # # # #
#  ##    ##   ## ##    ##___  #   # # #   #        ##  ##    # ##  ##  # #
#  #######   ##   ##    #####  ###  #  #  ####    #### ## ###  ##   ###  #
#________________________________________________________________________#
#                                                                        #
#  Copyright Spence Konde and other contributors 2020-2021               #
#  Based on megaTinyCore which in turn is based on official Arduino core #
#  Varying portions of different files in this core can be traced back   #
#  to the official core. In any event, it's all free software, under the #
#  (LGPL v2.1) see LICENSE.md and License section of README.md           #
#________________________________________________________________________#
#                                                                        #
#  Now reformatted for easy navigation with text editing tools which     #
#  have the zoomed out view that you can scroll through.                 #
#  The board section headings have a triangle along the right edge       #
#  if they are a non-bootloader definition.                              #
#________________________________________________________________________#
#                                                                        #
#                   ####   ###   ###  ####  ####   ###                   #
#                   #   # #   # #   # #   # #   # #                      #
#                   ####  #   # ##### ####  #   #  ###                   #
#                   #   # #   # #   # #  #  #   #     #                  #
#                   ####   ###  #   # #   # ####   ###                   #
#________________________________________________________________________#
#                                                                        #
# Names listed at the top so they can be kept in consistent format.      #
# Experience has shown that they end up drifting apart is style if       #
# they aren't all on the same screen                                     #
#                                                                        #
# EA, are not available yet. 64DD32/28 and 32/16DD20/14 parts are!       #
##########################################################################


##########################################################################
#                                                                        #
#             ###  #   # ####  #   # #### #   # #   #  ###               #
#            #     #   # #   # ## ## #    ##  # #   # #                  #
#             ###  #   # ####  # # # ###  # # # #   #  ###               #
#                # #   # #   # #   # #    #  ## #   #     #              #
#             ###   ###  ####  #   # #### #   #  ###   ###               #
#________________________________________________________________________#
# The *opti menus are for Optiboot board definitions - We name them
# differently when the option takes on different meaning for a bootloaded
# board. Eg - UPDI can set fuses, so OSCCFG is set on all uploads and
# you don't need to burn bootloader to change clock speed.
# 2.4.3 - the TCD0CFG fuse handling is U G L Y - but there isn't really
# another way to do it with the tools we get as hardware package folks.

menu.chip=Chip
menu.board=Board/version
menu.clock=Clock Speed
menu.millis=millis()/micros() timer
menu.bodvoltage=BOD level if enabled (Bootload burn req'd)
menu.bodmode=BOD Mode Active/Sleeping (Bootload burn req'd)
menu.eesave=Save EEPROM
menu.eesavedd=Save EEPROM (Bootload burn req'd)
menu.resetpin=Reset pin function
menu.resetupdipins=Reset and UPDI pin functions (Bootload burn req'd)
menu.startuptime=Startup Time
menu.bootloaderusart=Bootloader Serial Port (Bootload burn req'd)
menu.timeout=Bootloader Timeout (Bootload burn req'd)
menu.appspm=Flash Writing
menu.mvio=MultiVoltage I/O (MVIO)
menu.mvioopti=MultiVoltage I/O (MVIO) - (bootloader burn req'd)
menu.attach=attachInterrupt() Version
menu.printf=printf()
menu.wiremode=Wire (Wire.h/I2C) Library mode

##########################################################################
#                                                                        #
###              ####    ###    ###   ####   ####    ###               ###
#####            #   #  #   #  #   #  #   #  #   #  #                #####
#######          ####   #   #  #####  ####   #   #   ###           #######
#####            #   #  #   #  #   #  #  #   #   #      #            #####
###              ####    ###   #   #  #   #  ####    ###               ###
#________________________________________________________________________#
##########################################################################
# Names listed at the top so they can be kept in consistent format       #
# Only EA boards without optiboot sketched in - since we know like       #
# nothing about implementation, and how Dx-y it will be.                 #
#_________________________________________________________________________

avrda.name=AVR DA-series (no bootloader)
avrdb.name=AVR DB-series (no bootloader)
avrdd.name=AVR DD-series (no bootloader)
#avrea.name=AVR EA-series (no bootloader)
microchip.name=Microchip Curiosity Nano
avrdaopti.name=AVR DA-series (Optiboot)
avrdbopti.name=AVR DB-series (Optiboot)
avrddopti.name=AVR DD-series (Optiboot)
#avreaopti.name=AVR EA-series (Optiboot)
azduinoboard.name=Azduino Boards (Optiboot)

#----------------------------------------#
# printf() version options               #
#________________________________________#
avrda.menu.printf.default=Default, 1.5k flash, no floats
avrda.menu.printf.full=Full, 2.6k, prints floats
avrda.menu.printf.full.build.printf=-Wl,-u,vfprintf -lprintf_flt
avrda.menu.printf.full.build.printfabr=.pfF
avrda.menu.printf.minimal=Minimal, 1.1k flash used
avrda.menu.printf.minimal.build.printf=-Wl,-u,vfprintf -lprintf_min
avrda.menu.printf.minimal.build.printfabr=.pfM

