SpenceKonde/DxCore/megaavr/boards.txt
#----------------------------------------#
# Retain EEPROM (EESAVE)                 #
#________________________________________#
avrdd.menu.eesavedd.enable=EEPROM retained
avrdd.menu.eesavedd.enable.bootloader.eesavebit=1
avrdd.menu.eesavedd.disable=EEPROM not retained
avrdd.menu.eesavedd.disable.bootloader.eesavebit=0

#----------------------------------------#
# Reset pin as INPUT, UPDI as I/O        #
#________________________________________#
avrdd.menu.resetupdipins.reset=PF6: Reset & PF7: UPDI
avrdd.menu.resetupdipins.reset.bootloader.resetpinbits=11
avrdd.menu.resetupdipins.input=PF6: Input & UPDI (no challenges)
avrdd.menu.resetupdipins.input.bootloader.resetpinbits=10
avrdd.menu.resetupdipins.reset=PF6: Reset & GPIO (DD-compatible HV UPDI required)
avrdd.menu.resetupdipins.reset.bootloader.resetpinbits=01
avrdd.menu.resetupdipins.input=PF6: Input & GPIO (DD-compatible HV UPDI required)
avrdd.menu.resetupdipins.input.bootloader.resetpinbits=00

#----------------------------------------#
# millis/micros timing source            #
#________________________________________#
avrdd.menu.millis.tcbhighest=Default (recommended)
avrdd.menu.millis.disabled=Disabled (delay() only)
avrdd.menu.millis.tcb0=TCB0
avrdd.menu.millis.tcb1=TCB1 (default for 14/20 pins)
avrdd.menu.millis.tcb2=TCB2 (default for 28/32 pins)
avrdd.menu.millis.tca0=TCA0
avrdd.menu.millis.tcbhighest.build.millistimer={build.highestcb}
avrdd.menu.millis.tcb0.build.millistimer=B0
avrdd.menu.millis.tcb1.build.millistimer=B1
avrdd.menu.millis.tcb2.build.millistimer=B2
avrdd.menu.millis.tca0.build.millistimer=A0
#avrdd.menu.millis.tcd0.build.millistimer=D0
avrdd.menu.millis.disabled.build.millistimer=NONE

#----------------------------------------#
# printf() version options               #
#________________________________________#
avrdd.menu.printf.default=Default, 1.5k flash, no floats
avrdd.menu.printf.full=Full, 2.6k, prints floats
avrdd.menu.printf.full.build.printf=-Wl,-u,vfprintf -lprintf_flt
avrdd.menu.printf.full.build.printfabr=.pfF
avrdd.menu.printf.minimal=Minimal, 1.1k flash used
avrdd.menu.printf.minimal.build.printf=-Wl,-u,vfprintf -lprintf_min
avrdd.menu.printf.minimal.build.printfabr=.pfM


#----------------------------------------#
# attachInterrupt Mode                   #
#________________________________________#
avrdd.menu.attach.allenabled=On all pins, with new implementation.
avrdd.menu.attach.allenabled.build.attachmode=-DCORE_ATTACH_ALL
avrdd.menu.attach.manual=Only enabled ports. Please see documentation.
avrdd.menu.attach.manual.build.attachmode=-DCORE_ATTACH_NONE
avrdd.menu.attach.oldversion=Old version, may fix bugs.
avrdd.menu.attach.oldversion.build.attachmode=-DCORE_ATTACH_OLD
avrdd.menu.attach.manual.build.attachabr=.aMan
avrdd.menu.attach.oldversion.build.attachabr=.aOld

#----------------------------------------#
# MVIO menu                              #
#________________________________________#
avrdd.menu.mvio.enabled=Enabled
avrdd.menu.mvio.enabled.bootloader.mviobits=01
avrdd.memu.mvio.enabled.build.MVIOenable=-DMVIO_ENABLED
avrdd.menu.mvio.disabled=Disabled
avrdd.menu.mvio.disabled.bootloader.mviobits=10
avrdd.memu.mvio.disabled.build.MVIOenable=

#----------------------------------------#
# Startup time options                   #
#________________________________________#
avrdd.menu.startuptime.8=8ms
avrdd.menu.startuptime.0=0ms
avrdd.menu.startuptime.1=1ms
avrdd.menu.startuptime.2=2ms
avrdd.menu.startuptime.4=4ms
avrdd.menu.startuptime.16=16ms
avrdd.menu.startuptime.32=32ms
avrdd.menu.startuptime.64=64ms
avrdd.menu.startuptime.0.bootloader.sutbits=000
avrdd.menu.startuptime.1.bootloader.sutbits=001
avrdd.menu.startuptime.2.bootloader.sutbits=010
avrdd.menu.startuptime.4.bootloader.sutbits=011
avrdd.menu.startuptime.8.bootloader.sutbits=100
avrdd.menu.startuptime.16.bootloader.sutbits=101
avrdd.menu.startuptime.32.bootloader.sutbits=110
avrdd.menu.startuptime.64.bootloader.sutbits=111

#-------------------------------------#
#         Wire Mode Selection         #
#     To enable master+slave mode     #
#_____________________________________#
avrdd.menu.wiremode.mors= Master or Slave
avrdd.menu.wiremode.mors.build.wire.mode=MORS_SINGLE
avrdd.menu.wiremode.mors.build.wireabr=.wO
avrdd.menu.wiremode.mands=Master and Slave
avrdd.menu.wiremode.mands.build.wire.mode=MANDS_SINGLE
avrdd.menu.wiremode.mands.build.wireabr=.wA

#-------------------------------------#
#         SPM from app mode           #
# To enable writing flash from app    #
#_____________________________________#
avrdd.menu.appspm.no=Disabled
avrdd.menu.appspm.no.bootloader.appspm=
avrdd.menu.appspm.no.bootloader.BOOTSIZE=0x00
avrdd.menu.appspm.no.build.appspmabr=
avrdd.menu.appspm.full=Anywhere
avrdd.menu.appspm.full.bootloader.appspm=-DSPM_FROM_APP=-1
avrdd.menu.appspm.full.build.appspmabr=.spmALL
avrdd.menu.appspm.8plus=Above 8k (Not recommended except for AVR16)
avrdd.menu.appspm.8plus.bootloader.appspm=-DSPM_FROM_APP=16
avrdd.menu.appspm.8plus.bootloader.CODESIZE=16
avrdd.menu.appspm.12plus=Above 12k (Not recommended except for AVR16)
avrdd.menu.appspm.12plus.bootloader.appspm=-DSPM_FROM_APP=24
avrdd.menu.appspm.12plus.bootloader.CODESIZE=24
avrdd.menu.appspm.16plus=Above 16k (AVR64/32 only)
avrdd.menu.appspm.16plus.bootloader.appspm=-DSPM_FROM_APP=32
avrdd.menu.appspm.16plus.bootloader.CODESIZE=32
avrdd.menu.appspm.24plus=Above 24k (AVR64/32 only)
avrdd.menu.appspm.24plus.bootloader.appspm=-DSPM_FROM_APP=48
avrdd.menu.appspm.24plus.bootloader.CODESIZE=48
avrdd.menu.appspm.32plus=Above 32k (AVR64 only)
avrdd.menu.appspm.32plus.bootloader.appspm=-DSPM_FROM_APP=64
avrdd.menu.appspm.32plus.bootloader.CODESIZE=64
avrdd.menu.appspm.48plus=Above 48k (AVR64 only)
avrdd.menu.appspm.48plus.bootloader.appspm=-DSPM_FROM_APP=96
avrdd.menu.appspm.48plus.bootloader.CODESIZE=96
avrdd.menu.appspm.56plus=Above 56k (AVR64 only)
avrdd.menu.appspm.56plus.bootloader.appspm=-DSPM_FROM_APP=112
avrdd.menu.appspm.56plus.bootloader.CODESIZE=112

##########################################################################
#                                                                        #
###                 ###  #     # ####      #####   ###                 ###
#####              #   # #     # #   #     #      #   #              #####
#######            #####  #   #  ####  ### ####   #####            #######
#####              #   #   # #   # #       #      #   #              #####
###                #   #    #    #  #      #####  #   #                ###
#________________________________________________________________________#
#                                        #
# Parameters and defaults for EA parts   #
#________________________________________#
#avrea.upload.tool=avrdude
#avrea.upload.prog_interlock=
#avrea.build.board=avrea
#avrea.build.core=dxcore
#avrea.build.f_cpu={build.speed}000000L
#avrea.build.text_section_start=.text=0x0
#avrea.build.extra_flags=
#avrea.build.export_merged_output=false
#avrea.build.printf=

