SpenceKonde/DxCore/megaavr/boards.txt
#----------------------------------------#
# Exported hex/lst/map names will        #
# indicate selected options. These       #
# are only to do that, nothing else      #
#________________________________________#
azduinoboard.build.mcupostfix=opti
azduinoboard.build.printfabr=
azduinoboard.build.attachabr=
azduinoboard.build.wireabr=
azduinoboard.build.appspmabr=

#^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^#
# AVR-DB submenu options                     #
#____________________________________________#
# Chip (memory and pincount)             #
#________________________________________#
azduinoboard.menu.board.NanoDB_A=Azduino_NanoDB_RevA
azduinoboard.menu.board.NanoDB_A.build.board=Azduino_NanoDB_A
azduinoboard.menu.board.NanoDB_A.build.mcu=avr128db32
azduinoboard.menu.board.NanoDB_A.bootloader.class=optiboot_dx128
azduinoboard.menu.board.NanoDB_A.upload.maximum_size=130560
azduinoboard.menu.board.NanoDB_A.upload.maximum_data_size=16384
azduinoboard.menu.board.NanoDB_A.bootloader.portname=Serial0
azduinoboard.menu.board.NanoDB_A.bootloader.portswap=1
azduinoboard.menu.board.NanoDB_A.build.extra_flags=-DMUX_DEFAULT_USART0=1  -DXTAL_PINS_HARDWIRED -DHARDWIRE_INPUT_ONLY=PIN_PA5 -DLED_BUILTIN2=PIN_PA6 -DUSING_OPTIBOOT {build.MVIOenable}
azduinoboard.menu.board.NanoDB_A.build.variant=32pin-standard
azduinoboard.menu.board.NanoDD_A=Azduino_NanoDD_RevA
azduinoboard.menu.board.NanoDD_A.build.board=Azduino_NanoDD_A
azduinoboard.menu.board.NanoDD_A.build.mcu=avr64dd32
azduinoboard.menu.board.NanoDD_A.bootloader.class=optiboot_dd32
azduinoboard.menu.board.NanoDD_A.upload.maximum_size=65024
azduinoboard.menu.board.NanoDD_A.upload.maximum_data_size=8192
azduinoboard.menu.board.NanoDD_A.bootloader.portname=Serial0
azduinoboard.menu.board.NanoDD_A.bootloader.portswap=1
azduinoboard.menu.board.NanoDD_A.build.extra_flags=-DMUX_DEFAULT_USART0=1  -DXTAL_PINS_HARDWIRED -DHARDWIRE_INPUT_ONLY=PIN_PA5 -DLED_BUILTIN2=PIN_PA6 -DUSING_OPTIBOOT {build.MVIOenable}
azduinoboard.menu.board.NanoDD_A.build.variant=32pin-ddseries
#azduinoboard.menu.board.NanoDB_B=Azduino Nano DB (Rev. B or A w/resistor mod)
#azduinoboard.menu.board.NanoDB_B.build.mcu=avr128db32
#azduinoboard.menu.board.NanoDB_B.bootloader.class=optiboot_dx128
#azduinoboard.menu.board.NanoDB_B.upload.maximum_size=130560
#azduinoboard.menu.board.NanoDB_B.upload.maximum_data_size=16384
#azduinoboard.menu.board.NanoDB_B.bootloader.portname=Serial0
#azduinoboard.menu.board.NanoDB_B.bootloader.portswap=1
azduinoboard.menu.board.LEDCTRLA.build.extra_flags=-DMUX_DEFAULT_USART0=1 -DXTAL_PINS_HARDWIRED -DLED_BUILTIN2=PIN_PF0 -DLED_BUILTIN3=PIN_PF1 -DUSING_OPTIBOOT {build.MVIOenable}
azduinoboard.menu.board.LEDCTRLA=LEDCTRLA Light Controller 2.1+
azduinoboard.menu.board.LEDCTRLA=Azduino_LEDCTRLA
azduinoboard.menu.board.LEDCTRLA.build.mcu=avr128db48
azduinoboard.menu.board.LEDCTRLA.bootloader.class=optiboot_dx128
azduinoboard.menu.board.LEDCTRLA.upload.maximum_size=130560
azduinoboard.menu.board.LEDCTRLA.upload.maximum_data_size=16384
azduinoboard.menu.board.LEDCTRLA.build.variant=48pin-standard

#----------------------------------------#
# Clock speed and source options         #
# For the Azduino products we drop clock #
# speeds we think are unlikely to see    #
# use. These ship with 16-40 MHz xtal    #
#________________________________________#
azduinoboard.menu.clock.24internal=24 MHz internal
azduinoboard.menu.clock.24internal.build.speed=24
azduinoboard.menu.clock.24internal.build.clocksource=0
azduinoboard.menu.clock.20internal=20 MHz internal
azduinoboard.menu.clock.20internal.build.speed=20
azduinoboard.menu.clock.20internal.build.clocksource=0
azduinoboard.menu.clock.16internal=16 MHz internal
azduinoboard.menu.clock.16internal.build.speed=16
azduinoboard.menu.clock.16internal.build.clocksource=0
azduinoboard.menu.clock.24crystal=24 MHz crystal
azduinoboard.menu.clock.24crystal.build.speed=24
azduinoboard.menu.clock.24crystal.build.clocksource=1
azduinoboard.menu.clock.20crystal=20 MHz crystal
azduinoboard.menu.clock.20crystal.build.speed=20
azduinoboard.menu.clock.20crystal.build.clocksource=1
azduinoboard.menu.clock.16crystal=16 MHz crystal
azduinoboard.menu.clock.16crystal.build.speed=16
azduinoboard.menu.clock.16crystal.build.clocksource=1
azduinoboard.menu.clock.32crystal=32 MHz crystal (highly overclocked)
azduinoboard.menu.clock.32crystal.build.speed=32
azduinoboard.menu.clock.32crystal.build.clocksource=1
azduinoboard.menu.clock.40crystal=40 MHz crystal (highly overclocked)
azduinoboard.menu.clock.40crystal.build.speed=40
azduinoboard.menu.clock.40crystal.build.clocksource=1
azduinoboard.menu.clock.32internal=32 MHz internal (overclocked)
azduinoboard.menu.clock.32internal.build.speed=32
azduinoboard.menu.clock.32internal.build.clocksource=0
azduinoboard.menu.clock.4internal=4 MHz internal
azduinoboard.menu.clock.4internal.build.speed=4
azduinoboard.menu.clock.4internal.build.clocksource=0
azduinoboard.menu.clock.1internal=1 MHz internal
azduinoboard.menu.clock.1internal.build.speed=1
azduinoboard.menu.clock.1internal.build.clocksource=0
azduinoboard.menu.clock.30crystal=30 MHz crystal (overclocked)
azduinoboard.menu.clock.30crystal.build.speed=30
azduinoboard.menu.clock.30crystal.build.clocksource=1

#----------------------------------------#
# BrownOut detection (BOD) options       #
#________________________________________#
azduinoboard.menu.bodvoltage.2v85=2.85V (Recommended if powered from USB - if Vusb < 2.85V, something else is wrong)
azduinoboard.menu.bodvoltage.2v85.bootloader.bodlevbits=011
azduinoboard.menu.bodvoltage.1v9=1.9V
azduinoboard.menu.bodvoltage.1v9.bootloader.bodlevbits=000
azduinoboard.menu.bodvoltage.2v45=2.45V
azduinoboard.menu.bodvoltage.2v45.bootloader.bodlevbits=001
azduinoboard.menu.bodvoltage.2v70=2.70V
azduinoboard.menu.bodvoltage.2v70.bootloader.bodlevbits=010
azduinoboard.menu.bodmode.disabled=Disabled/Disabled
azduinoboard.menu.bodmode.enabled=Enabled/Enabled
azduinoboard.menu.bodmode.ensampfast=Enabled/Sampled (128 Hz)
azduinoboard.menu.bodmode.ensampslow=Enabled/Sampled (32 Hz)
azduinoboard.menu.bodmode.sampledfast=Sampled/Sampled (128 Hz)
azduinoboard.menu.bodmode.sampledslow=Sampled/Sampled (32 Hz)
azduinoboard.menu.bodmode.sampdisfast=Sampled/Disabled (128 Hz)
azduinoboard.menu.bodmode.sampdisslow=Sampled/Disabled (32 Hz)
azduinoboard.menu.bodmode.endisholdwake=Enabled hold wakeup/Disabled
azduinoboard.menu.bodmode.disabled.bootloader.BODCFG=0x00
azduinoboard.menu.bodmode.enabled.bootloader.bodmodebits=00101
azduinoboard.menu.bodmode.ensampfast.bootloader.bodmodebits=00110
azduinoboard.menu.bodmode.ensampslow.bootloader.bodmodebits=10110
azduinoboard.menu.bodmode.samplefast.bootloader.bodmodebits=01010
azduinoboard.menu.bodmode.sampleslow.bootloader.bodmodebits=11010
azduinoboard.menu.bodmode.sampdisfast.bootloader.bodmodebits=01000
azduinoboard.menu.bodmode.sampdisslow.bootloader.bodmodebits=11000
azduinoboard.menu.bodmode.endisholdwake.bootloader.bodmodebits=01100

