SpenceKonde/DxCore/megaavr/boards.txt
#----------------------------------------#
# Reset pin as input option              #
#________________________________________#
azduinoboard.menu.resetpin.reset=Hardware Reset (recommended)
azduinoboard.menu.resetpin.reset.bootloader.resetpinbits=10
azduinoboard.menu.resetpin.input=Input (no output, ever)
azduinoboard.menu.resetpin.input.bootloader.resetpinbits=00

#----------------------------------------#
# millis/micros timing source            #
#________________________________________#
azduinoboard.menu.millis.tcb2=TCB2 (recommended)
azduinoboard.menu.millis.disabled=Disabled (delay() only)
azduinoboard.menu.millis.tcb0=TCB0
azduinoboard.menu.millis.tcb1=TCB1
azduinoboard.menu.millis.tcb3=TCB3 (48/64-pin parts only)
azduinoboard.menu.millis.tca0=TCA0
azduinoboard.menu.millis.tca1=TCA1 (48/64-pin parts only)
azduinoboard.menu.millis.tcb0.build.millistimer=B0
azduinoboard.menu.millis.tcb1.build.millistimer=B1
azduinoboard.menu.millis.tcb2.build.millistimer=B2
azduinoboard.menu.millis.tcb3.build.millistimer=B3
azduinoboard.menu.millis.tca0.build.millistimer=A0
azduinoboard.menu.millis.tca1.build.millistimer=A1
azduinoboard.menu.millis.disabled.build.millistimer=NONE

#----------------------------------------#
# printf() version options               #
#________________________________________#
azduinoboard.menu.printf.default=Default (doesn't print floats, 1.4k flash use)
azduinoboard.menu.printf.full=Full, 2.6k, prints floats
azduinoboard.menu.printf.full.build.printf=-Wl,-u,vfprintf -lprintf_flt
azduinoboard.menu.printf.full.build.printfabr=.pfF
azduinoboard.menu.printf.minimal=Minimal, 1.1k flash used
azduinoboard.menu.printf.minimal.build.printf=-Wl,-u,vfprintf -lprintf_min
azduinoboard.menu.printf.minimal.build.printfabr=.pfM

#----------------------------------------#
# attachInterrupt Mode                   #
#________________________________________#
azduinoboard.menu.attach.allenabled=On all pins, with new implementation.
azduinoboard.menu.attach.allenabled.build.attachmode=-DCORE_ATTACH_ALL
azduinoboard.menu.attach.manual=Only enabled ports. Please see documentation.
azduinoboard.menu.attach.manual.build.attachmode=-DCORE_ATTACH_NONE
azduinoboard.menu.attach.oldversion=Old version, (may fix bugs)
azduinoboard.menu.attach.oldversion.build.attachmode=-DCORE_ATTACH_OLD
azduinoboard.menu.attach.manual.build.attachabr=.aMan
azduinoboard.menu.attach.oldversion.build.attachabr=.aOld

#----------------------------------------#
# MVIO menu                              #
#________________________________________#
azduinoboard.menu.mvioopti.enabled=Enabled
azduinoboard.menu.mvioopti.enabled.bootloader.mviobits=01
azduinoboard.memu.mvioopti.enabled.build.MVIOenable=-DMVIO_ENABLED
azduinoboard.menu.mvioopti.disabled=Disabled
azduinoboard.menu.mvioopti.disabled.bootloader.mviobits=10
azduinoboard.memu.mvioopti.disabled.build.MVIOenable=
azduinoboard.menu.mvioopti.reallyenabled=Enabled and "burn bootloader" has for sure done w/this selected.
azduinoboard.menu.mvioopti.reallyenabled.bootloader.mviobits=01
azduinoboard.memu.mvioopti.reallyenabled.build.MVIOenable==-DMVIO_ENABLED -DASSUME_MVIO_FUSE
azduinoboard.menu.mvioopti.reallydisabled=Disabled and "burn bootloader" has for sure been done w/this selected.
azduinoboard.menu.mvioopti.reallydisabled.bootloader.mviobits=10
azduinoboard.memu.mvioopti.reallydisabled.build.MVIOenable=-DASSUME_MVIO_FUSE

#----------------------------------------#
# Startup time options                   #
#________________________________________#
azduinoboard.menu.startuptime.8=8ms
azduinoboard.menu.startuptime.0=0ms
azduinoboard.menu.startuptime.1=1ms
azduinoboard.menu.startuptime.2=2ms
azduinoboard.menu.startuptime.4=4ms
azduinoboard.menu.startuptime.16=16ms
azduinoboard.menu.startuptime.32=32ms
azduinoboard.menu.startuptime.64=64ms
azduinoboard.menu.startuptime.0.bootloader.sutbits=000
azduinoboard.menu.startuptime.1.bootloader.sutbits=001
azduinoboard.menu.startuptime.2.bootloader.sutbits=010
azduinoboard.menu.startuptime.4.bootloader.sutbits=011
azduinoboard.menu.startuptime.8.bootloader.sutbits=100
azduinoboard.menu.startuptime.16.bootloader.sutbits=101
azduinoboard.menu.startuptime.32.bootloader.sutbits=110
azduinoboard.menu.startuptime.64.bootloader.sutbits=111

#-------------------------------------#
#         Wire Mode Selection         #
# To enable TWI1 or master+slave mode #
#_____________________________________#
azduinoboard.menu.wiremode.mors1=1x Wire, Master or Slave (least Flash & RAM)
azduinoboard.menu.wiremode.mors1.build.wire.mode=MORS_SINGLE
azduinoboard.menu.wiremode.mors1.build.wireabr=.wO
azduinoboard.menu.wiremode.mands1=1x Wire, Master and Slave
azduinoboard.menu.wiremode.mands1.build.wire.mode=MANDS_SINGLE
azduinoboard.menu.wiremode.mands1.build.wireabr=.wA
azduinoboard.menu.wiremode.mors2=2x Wire, Master or Slave (not available on Nano DD)
azduinoboard.menu.wiremode.mors2.build.wire.mode=MORS_BOTH
azduinoboard.menu.wiremode.mors2.build.wireabr=.wO2
azduinoboard.menu.wiremode.mands2=2x Wire, Master and Slave (not available on Nano DB)
azduinoboard.menu.wiremode.mands2.build.wire.mode=MANDS_BOTH
azduinoboard.menu.wiremode.mands2.build.wireabr=.wA2
